module.exports = [
    {
        name: "Программист-прагматик. Путь от подмастерья к мастеру",
        description: "Эта книга не о технологиях и языках программирования. Она о принципах и подходах – о том, чем программирование является по своей сути. Именно поэтому я поставил ее первой в списке. Многое покажется очевидным, с чем-то вы будете спорить, в чем-то сомневаться и долго искать ответы на собственном опыте. Но однозначно именно эти и подобные принципы и подходы определяют вас как разработчика.",
        pages: 350,
        price: 300,
        authors: ["Э. Хант", "Д. Томас"],
        publisher: "Пресс-бук"
    },
    {
        name: "Приемы объектно-ориентированного проектирования. Паттерны проектирования",
        description: "Удивительно полезная книга знаменитой «банды четырех» (Gang of Four). Отличный пример структурированного и продуманного изложения. По сути, книга заложила терминологию, которой пользуются практически все программисты, обсуждая то или иное архитектурное решение.",
        pages: 800,
        price: 350,
        authors: ["Э. Гамма", "Р. Хелм", "Р. Джонсон", "Д. Влиссидес"],
        publisher: "Профиздат"
    },
    {
        name: "Язык программирования C",
        description: "Хорошие книги не стареют. Возможно, вы никогда не столкнетесь с разработкой на языке C, но, если будет время, прочтите книгу. Прекрасный пример того, как просто, лаконично и доходчиво описать структуру и возможности языка. Удивительно, как на относительно небольшом количестве страниц авторам удалось изложить суть языка и при этом избежать сухости и излишней строгости формулировок.",
        pages: 600,
        price: 180,
        authors: ["Б. Керниган", "Д. Ритчи"],
        publisher: "Пресс-бук"
    },
    {
        name: "CLR via C#",
        description: "Джеффри Рихтер подробно рассказывает о языке C#, а также об устройстве и фундаментальных принципах функционирования .NET-платформы. Традиционный вопрос на наших собеседованиях: «Вы читали Рихтера? Сколько раз?». Вопрос звучит неизменно многие годы, лишь книги меняются. Раньше была «Windows via C/C++», теперь – эта.",
        pages: 500,
        price: 240,
        authors: ["Дж. Рихтер"],
        publisher: "Пресс-бук"
    },
    {
        name: "Распределенные системы. Принципы и парадигмы",
        description: "Возможно, это не самая яркая работа Таненбаума (вспомнить хотя бы его «Операционные системы. Разработка и реализация» или спор с Линусом Торвальдсом), но достойная книга для прочтения.",
        pages: 500,
        price: 300,
        authors: ["Э. Таненбаум", "М. ван Стеен"],
        publisher: "Профиздат"
    },
    {
        name: "Искусственный интеллект",
        description: "Книга посвящена фундаментальным проблемам создания искусственного интеллекта и существующим подходам к их решению. В ней рассматриваются задачи распознавания образов, машинного доказательства теорем, восприятие машиной окружающего физического мира и, наконец, понимание машиной естественного языка. Особое внимание уделяется основным идеям и принципам искусственного интеллекта.",
        pages: 400,
        price: 111,
        authors: ["Э. Хант"],
        publisher: "Эксмо"
    }
]